surfaceWater/runCases/RANS_2D/MeshSelection4/3mmx0.1mm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1056
(
(0.0173457 0.00275287 2.0297e-25)
(0.0174187 0.00276111 2.05744e-25)
(0.0175282 0.00277427 2.09657e-25)
(0.0176875 0.00279424 2.15079e-25)
(0.0232657 0.00338192 4.94437e-26)
(0.0237124 0.00342772 4.32778e-26)
(0.0329363 0.00418891 -3.85777e-22)
(0.033269 0.00419017 -3.74027e-22)
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            noSlip;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
32
(
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.0219018 0.00306437 -1.84535e-20)
(0.0219018 0.00306437 -1.84535e-20)
(0.0293233 0.00323583 8.67499e-21)
(0.0293233 0.00323583 8.67499e-21)
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
32
(
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.00847064 0.00148773 9.21264e-25)
(0.0219018 0.00306437 -1.84535e-20)
(0.0219018 0.00306437 -1.84535e-20)
(0.0293233 0.00323583 8.67499e-21)
(0.0293233 0.00323583 8.67499e-21)
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
